#A = Array{Float64}(undef, 5, 11)#5代表5个节点，代表压力，温度，质量流量，密度，晗，5个变量
#B=[293 297 305 308 ]
#（改成常用组分甲烷，乙烷，丙烷，氮气，二氧化碳，氢气摩尔分数）6种加起来为100% 11个变量 55个方程
#j为已知条件，j+1为A[j,n];t_s代表初始时刻
#先以5个节点为例，之后把管段进行分节点
#查找为什么要对于整个组分列连续性方程
#如果以6中摩尔分数作为变量，那组分可以用它表示出来，那直接调用srk方程就可以了
#需要将t1时刻计算结束后再当成初始条件
#1-压力，2-温度，3-质量流量，4-密度，5-晗，6-氢气，7-甲烷，8-乙烷，9-丙烷，10-氮气，11-二氧化碳；
#--------------对于初始条件需要进行赋值(t_s)-------------------------------------------
function f!(F, A)
    k = 0#方程和节点数混淆
    T0=278.15#土壤温度
    dt = 10#s
    dx = 100000#m
    γ = dt / dx
    D = 1.112#外径
    Ke=0.017#粗糙度mm
   λ=1/(-2*log10(Ke/(3.7*D*1000)))^2
    CRXS = 1.15#传热
    d = 0.998
    bc = π * d^2 / 4
#------------------------------------------------总连续性方程（2个管段）（2个方程）m是单位面积上的--------------------------------
    for j in 2:2:4
        k = k + 1
        F[k] = A[j, 4] + A[j+1, 4] - md[j] - md[j+1] + γ * (M[j+1] - M[j] + A[j+1, 3] - A[j, 3]) / bc
    end
#-------------------------------------------------动量方程（2个管段）压力单位是Pa（2个方程）--------------------------------
    for j in 2:2:4
        k = k + 1
        F[k] = (A[j, 3] + A[j+1, 3] - M[j+1] - M[j]) / bc + γ * ((A[j+1, 3] / bc)^2 / A[j+1, 4] + A[j+1, 1] * 10^6 - (A[j, 3] / bc)^2 / A[j, 4] -
                A[j, 1] * 10^6 + (M[j+1] / bc)^2 / md[j+1] + P[j+1] * 10^6 - (M[j] / bc)^2 / md[j] - P[j] * 10^6) +
               dt * λ / 4 / d * ((A[j+1, 3] / bc)^2 / A[j+1, 4] + (A[j, 3] / bc)^2 /
                A[j, 4] + (M[j+1] / bc)^2 / md[j+1] + (M[j] / bc)^2 / md[j])
        #+dt*g*ds/dx*(A[j+1,4]+A[j,4]+md[j+1,t_s]+md[j,t_s])#高程不用考虑ds     
    end
#------------------------------------------------能量方程（2个管段）（2个方程）(T0为土壤温度)----------------------------------
    for j in 2:2:4
        k = k + 1
        F[k] = A[j, 5] * A[j, 4] - A[j, 1] * 10^6 + (A[j, 3] / bc)^2 / 2 / A[j, 4] - h[j] * md[j] + P[j] * 10^6 - (M[j] / bc)^2 / 2 / md[j] + A[j+1, 5] * A[j+1, 4] -
               A[j+1, 1] * 10^6 + (A[j+1, 3] / bc)^2 / 2 / A[j+1, 4] - h[j+1] * md[j+1] + P[j+1] * 10^6 - M[j+1]^2 / 2 / md[j+1] + γ * (A[j+1, 5] * (A[j+1, 3] / bc) +
               (A[j+1, 3] / bc)^3 / 2 / (A[j+1, 4])^2 - A[j, 4] * (A[j, 3] / bc) - (A[j, 3] / bc)^3 / 2 / A[j, 4]^2 + h[j+1] * (M[j+1] / bc) + (M[j+1] / bc)^3 / 2 / md[j+1]^2 -
                h[j] * (M[j] / bc) - (M[j] / bc)^3 / 2 / md[j]^2) +
               2 * CRXS * dt / D * (A[j+1, 2] + A[j, 2] + T[j] + T[j+1] - 4 * T0) #+ g * dt * ds / 2 / dx * (A[j+1, 3] + A[j, 3] + M[j] + M[j+1])
    end
#----------------------------------------------------对于a，b用expr1和expr2来表示----------------
    w = [0.0 0.013 0.1018 0.157 0.035 0.21]#偏心因子
    Tc = [32.98 190.69 305.38 369.89 126.15 304.09]#临界温度
    Pc1 = [12.93 46.04 48.8 42.5 33.99 73.82]#临界压力（Pa）单位为10^5Pa
    Pc = Pc1 * 10^(2)#单位为KPa
    μ = [2.01588 16.042 30.068 44.094 28.016 44.01]#相对分子质量
    K = [0 0 0 0 0 0
        0 0 0.01 0.023 0.025 0.05
        0 0.01 0 0.0031 0.07 0.048
        0 0.023 0.0031 0 0.1 0.045
        0 0.025 0.07 0.1 0 0
        0 0.05 0.048 0.045 0 0]
    a = []
    d = []
    ac = []
    global sdss=[]
    R = 8.314#kj/kmol/k
#--------------------------------------------------srk状态方程（5个节点）（10个方程）--------------------------------        
    for j in 1:5#压力单位为KPa
        k = k + 1
        Tcc = 0
        Pcc=0
        ww=0        
        μ0 = A[j, 6] * μ[1] + A[j, 7] * μ[2] + A[j, 8] * μ[3] + A[j, 9] * μ[4] + A[j, 10] * μ[5] + A[j, 11] * μ[6]#求当时的相对分子质量
        #b就不了,b[i]=0.08664*R*Tc[i]/Pc[i],b=b[i]*x[i]
        zf = [A[j, 6] A[j, 7] A[j, 8] A[j, 9] A[j, 10] A[j, 11]]
         for i in 1:length(zf)
            Tcc += zf[i] * Tc[i]
            Pcc += zf[i] * Pc[i]
            ww += zf[i] * w[i]
        end
        push!(sdss,Pcc)
        Expr1 = 0.08664 * R * (Tc[1] / Pc[1] * A[j, 6] + Tc[2] / Pc[2] * A[j, 7] + Tc[3] / Pc[3] * A[j, 8] +
                               Tc[4] / Pc[4] * A[j, 9] + Tc[5] / Pc[5] * A[j, 10] + Tc[6] / Pc[6] * A[j, 11])#b的表达式
        Expr2 = 0
        for i in 1:length(zf)
            mn = 0.42747 * (R^2) * (Tc[i]^2) / Pc[i]
            push!(ac, mn)
            mnl = 1 + (0.480 + 1.574 * w[i] - 0.176 * w[i]^2) * (1 - (A[j, 2] / Tcc)^(0.5))
            push!(d, mnl)
            s = ac[i] * d[i]
            push!(a, s)
        end
        for i in 1:length(zf)
            for n in 1:length(zf)
                Expr2 += zf[i] * zf[n] * (a[i] * a[n])^(0.5) * (1 - K[i, n])
            end
        end#(a)
        F[k] = R * A[j, 2] / (1 / (A[j, 4]/μ0) - Expr1) - Expr2 / (1 / A[j, 4]/μ0 * (1 / (A[j, 4]/μ0) + Expr1)) - A[j, 1]*10^3#a,b的求解
        Expr2 = 0
    end

#-------------------------------------------------晗的方程(P58)(单位为kj/kmol,需要化成j/kg)------------------------------
    for j in 1:5
        k = k + 1
        Expr2 = 0
        #(a,b)=srk(zf)#组分在发生改变，这个怎么确定并使用
        #b就不了,b[i]=0.08664*R*Tc[i]/Pc[i],b=b[i]*x[i]
        zf = [A[j, 6] A[j, 7] A[j, 8] A[j, 9] A[j, 10] A[j, 11]]
        #for i in 1:length(zf) 
        #Tcc+=Tc[i]*zf[i]
        #end#求总的临界温度
        #push!(gg,Tcc)
        μ0 = A[j, 6] * μ[1] + A[j, 7] * μ[2] + A[j, 8] * μ[3] + A[j, 9] * μ[4] + A[j, 10] * μ[5] + A[j, 11] * μ[6]
        Pcc = 0
        ww = 0
        Tcc = 0
        Expr1 = 0.08664 * R * (Tc[1] / Pc[1] * A[j, 6] + Tc[2] / Pc[2] * A[j, 7] + Tc[3] / Pc[3] * A[j, 8] +
                               Tc[4] / Pc[4] * A[j, 9] + Tc[5] / Pc[5] * A[j, 10] + Tc[6] / Pc[6] * A[j, 11])#b的表达式
        for i in 1:length(zf)
            Tcc += zf[i] * Tc[i]
            Pcc += zf[i] * Pc[i]
            ww += zf[i] * w[i]
        end
        for i in 1:length(Tc)
            mn = 0.42747 * (R^2) * (Tc[i]^2) / Pc[i]
            push!(ac, mn)
            mnl = 1 + (0.480 + 1.574 * w[i] - 0.176 * w[i]^2) * (1 - (A[j, 2] / Tc[i])^(0.5))#T[j]
            push!(d, mnl)
            s = ac[i] * d[i]
            push!(a, s)
        end
        for i in 1:length(zf)
            for n in 1:length(zf)
                Expr2 += zf[i] * zf[n] * (a[i] * a[n])^(0.5) * (1 - K[i, n])
            end
        end#（a）
        piandao1 = R / (1 /( A[j, 4]/μ0) - Expr1) - 0.42748 * R^2 * Tcc^2 / Pcc * ( (0.480 + 1.574 * ww - 0.176 * ww^2) * (-1 / 2 / (A[j, 2] * Tcc)^(0.5)) / (1/(A[j,4]/μ0)*(1/(A[j,4]/μ0)+Expr1)))#压力对温度的偏导
        piandao2 = 1 / ((-R * A[j, 2] / (1 / (A[j, 4]/μ0) - Expr1)^2) + Expr2 * (2 / (A[j, 4]/μ0) + Expr1) / (1 / (A[j, 4]/μ0) * (1 / (A[j, 4]/μ0) + Expr1))^2)#比容对压力的偏导
        F[k] = ((13.19 * (A[j, 2] - 273.15) + 0.046 * (A[j, 2])^2 - 273.15^2) - 6.24 / 3 / 10^5 * (A[j, 2]^3 - 273.15^3) - 1.915 * 10^11 / 4.08 * μ0 * A[j, 1]^1.124 / (A[j, 2]^4.08 - 273.15^4.08) +
               (1 / (A[j, 4]/μ0) - A[j, 2] * piandao1 * piandao2) * (A[j, 1] - 0.101325)) / μ0 * 1000 + 710600 - A[j, 5]#j/kg  
        Expr2 = 0
    end
#--------------------------------------------------浓度扩散方程（2个管段）6个组分以及关于混合物密度向纯物质密度转换（12个方程）----

    for j in 2:2:4#氢气（相对分子质量是在改变的）c1代表氢气的初始时刻在各节点的摩尔分数
        k = k + 1
        μ0 = A[j, 6] * μ[1] + A[j, 7] * μ[2] + A[j, 8] * μ[3] + A[j, 9] * μ[4] + A[j, 10] * μ[5] + A[j, 11] * μ[6]
        F[k] = A[j, 6] * A[j, 4] * μ[1] / μ0 + A[j+1, 6] * A[j+1, 4] * μ[1] / μ0 - md[j] * c1[j] * μ[1] / μ0 - md[j+1] * c1[j+1] * μ[1] / μ0 +
               γ * (M[j+1] / bc * c1[j+1] * μ[1] / μ0 - M[j] / bc * c1[j] * μ[1] / μ0 + A[j+1, 3] / bc * A[j+1, 6] * μ[1] / μ0 - A[j, 3] / bc * A[j, 6] * μ[1] / μ0)
    end
    for j in 2:2:5#甲烷，c2代表甲烷的初始时刻在各节点的摩尔分数
        k = k + 1
        μ0 = A[j, 6] * μ[1] + A[j, 7] * μ[2] + A[j, 8] * μ[3] + A[j, 9] * μ[4] + A[j, 10] * μ[5] + A[j, 11]
        F[k] = A[j, 7] * A[j, 4] * μ[2] / μ0 + A[j+1, 7] * A[j+1, 4] * μ[2] / μ0 - md[j] * c2[j] * μ[2] / μ0 - md[j+1] * c2[j+1] * μ[2] / μ0 +
               γ * (M[j+1] * c2[j+1] * μ[2] / μ0 - M[j] * c2[j] * μ[2] / μ0 +
                    A[j+1, 3] * A[j+1, 7] * μ[2] / μ0 - A[j, 3] * A[j, 7] * μ[2] / μ0) / bc
    end
    for j in 2:2:5#乙烷，c3代表乙烷的初始时刻在各节点的摩尔分数
        k = k + 1
        μ0 = A[j, 6] * μ[1] + A[j, 7] * μ[2] + A[j, 8] * μ[3] + A[j, 9] * μ[4] + A[j, 10] * μ[5] + A[j, 11]
        F[k] = (A[j, 8] * A[j, 4] + A[j+1, 8] * A[j+1, 4] - md[j] * c3[j] - md[j+1] * c3[j+1]) * μ[3] / μ0 +
               γ * (M[j+1] * c3[j+1,] * μ[3] / μ0 - M[j] * c3[j] * μ[3] / μ0 +
                    A[j+1, 3] * A[j+1, 8] * μ[3] / μ0 - A[j, 3] * A[j, 8] * μ[3] / μ0) / bc
    end
    for j in 2:2:5#丙烷，c4代表丙烷的初始时刻在各节点的摩尔分数
        k = k + 1
        μ0 = A[j, 6] * μ[1] + A[j, 7] * μ[2] + A[j, 8] * μ[3] + A[j, 9] * μ[4] + A[j, 10] * μ[5] + A[j, 11]
        F[k] = (A[j, 9] * A[j, 4] + A[j+1, 9] * A[j+1, 4] - md[j] * c4[j] - md[j+1] * c4[j+1]) * μ[4] / μ0 +
               γ * (M[j+1] * c4[j+1] * μ[4] / μ0 - M[j] * c4[j] * μ[4] / μ0 +
                    A[j+1, 3] * A[j+1, 9] * μ[4] / μ0 - A[j, 3] * A[j, 9] * μ[4] / μ0) / bc
    end
    for j in 2:2:5#氮气，c5代表氮气的初始时刻在各节点的摩尔分数
        k = k + 1
        μ0 = A[j, 6] * μ[1] + A[j, 7] * μ[2] + A[j, 8] * μ[3] + A[j, 9] * μ[4] + A[j, 10] * μ[5] + A[j, 11]
        F[k] = (A[j, 10] * A[j, 4] + A[j+1, 10] * A[j+1, 4] - md[j] * c5[j] - md[j+1] * c5[j+1]) * μ[5] / μ0 +
               γ * (M[j+1] * c5[j+1] * μ[5] / μ0 - M[j] * c5[j] * μ[5] / μ0 +
                    A[j+1, 3] * A[j+1, 10] * μ[5] / μ0 - A[j, 3] * A[j, 10] * μ[5] / μ0) / bc
    end
    for j in 2:2:5#二氧化碳，c6代表二氧化碳的初始时刻在各节点的摩尔分数
        k = k + 1
        μ0 = A[j, 6] * μ[1] + A[j, 7] * μ[2] + A[j, 8] * μ[3] + A[j, 9] * μ[4] + A[j, 10] * μ[5] + A[j, 11]
        F[k] = (A[j, 11] * A[j, 4] + A[j+1, 11] * A[j+1, 4] - md[j] * c6[j] - md[j+1] * c6[j+1]) * μ[6] / μ0 +
               γ * (M[j+1] * c6[j+1] * μ[6] / μ0 - M[j] * c6[j] * μ[6] / μ0 + A[j+1, 3] *
               A[j+1, 11] * μ[6] / μ0 - A[j, 3] * A[j, 11] * μ[6] / μ0) / bc
    end
    #----------------------------------------对k_t和k_v用expr3和expr5表示--------------------------------------
#--------------------------------------------------压缩机方程（2个压缩机）（16个方程）-------------------------------------------------------
    for j in 1:2:4#是否要对压缩机的参数进行特殊指定(T),压力应该为MPa
        #----------------------------------------expr的代指-----------------
        k = k + 1
        Expr2 = 0
        #(a,b)=srk(zf)#组分在发生改变，这个怎么确定并使用
        #b就不了,b[i]=0.08664*R*Tc[i]/Pc[i],b=b[i]*x[i]
        zf = [A[j, 6] A[j, 7] A[j, 8] A[j, 9] A[j, 10] A[j, 11]]
        #for i in 1:length(zf) 
        #push!(gg,Tcc)
        μ0 = A[j, 6] * μ[1] + A[j, 7] * μ[2] + A[j, 8] * μ[3] + A[j, 9] * μ[4] + A[j, 10] * μ[5] + A[j, 11] * μ[6]
        Pcc = 0
        ww = 0
        Tcc = 0
        Expr1 = 0.08664 * R * (Tc[1] / Pc[1] * A[j, 6] + Tc[2] / Pc[2] * A[j, 7] + Tc[3] / Pc[3] * A[j, 8] +
                 Tc[4] / Pc[4] * A[j, 9] + Tc[5] / Pc[5] * A[j, 10] + Tc[6] / Pc[6] * A[j, 11])#b的表达式
        for i in 1:length(zf)
            Tcc += zf[i] * Tc[i]
            Pcc += zf[i] * Pc[i]
            ww += zf[i] * w[i]
        end
        for i in 1:length(Tc)
            mn = 0.42747 * (R^2) * (Tc[i]^2) / Pc[i]
            push!(ac, mn)
            mnl = 1 + (0.480 + 1.574 * w[i] - 0.176 * w[i]^2) * (1 - (A[j, 2] / Tcc)^(0.5))#T[j]
            push!(d, mnl)
            s = ac[i] * d[i]
            push!(a, s)
        end
        for i in 1:length(zf)
            for n in 1:length(zf)
                Expr2 += zf[i] * zf[n] * (a[i] * a[n])^(0.5) * (1 - K[i, n])
            end
        end#（a）
        piandao1 = R / (1 /( A[j, 4]/μ0) - Expr1) - 0.42748 * R^2 * Tcc^2 / Pcc * ( (0.480 + 1.574 * ww - 0.176 * ww^2) * (-1 / 2 / (A[j, 2] * Tcc)^(0.5)) / (1/(A[j,4]/μ0)*(1/(A[j,4]/μ0)+Expr1)))#压力对温度的偏导
        piandao2 = 1 / ((-R * A[j, 2] / (1 / (A[j, 4]/μ0) - Expr1)^2) + Expr2 * (2 / (A[j, 4]/μ0) + Expr1) / (1 / (A[j, 4]/μ0) * (1 / (A[j, 4]/μ0) + Expr1))^2)#比容对压力的偏导
        #piandao4 = R * T / (1 - md * Expr1)^2 - (2 * Expr2 * md + Expr1 * Expr2 * (md)^2) / (1 + (md) * Expr1)^2
        Expr3 = 1 / (1 - A[j, 1]*1000/ (A[j, 4]/μ0)^2 / (13.19 + 0.092 * A[j, 2] - 6.24 * 10^(-5) * A[j, 2]^2 + 1.915 * 10^11 *
                 μ0 * ((A[j, 1])^1.124) / (A[j, 2]^5.08)) * piandao1 / (R * A[j, 2] / (1 - (A[j, 4]/μ0) * Expr1)^2 - (2 * Expr2 * (A[j, 4]/μ0) + Expr1 * Expr2 * (A[j, 4]/μ0)^2) / (1 +( A[j, 4]/μ0) * Expr1)^2))#K_T
        Expr4 = (13.19 + 0.092 * A[j, 2] - 6.24 * 10^(-5) * A[j, 2]^2 + 1.915 * 10^11 * μ0 * ((A[j, 1])^1.124) /
                 (A[j, 2]^5.08)) - A[j, 2] / A[j, 4]^2 * piandao1^2 / (R * A[j, 2] / (1 - A[j, 4] * Expr1)^2 - (2 * Expr2 * A[j, 4] + Expr1 * Expr2 * A[j, 4]^2) / (1 + A[j, 4] * Expr1)^2)^2#Cvm
        Expr5 = A[j, 4] * (13.19 + 0.092 * A[j, 2] - 6.24 * 10^(-5) * A[j, 2]^2 + 1.915 * 10^11 * μ0 * ((A[j, 1])^1.124) /
                 (A[j, 2]^5.08)) * (R * A[j, 2] / (1 - A[j, 4] * Expr1)^2 - (2 * Expr2 * A[j, 4] + Expr1 * Expr2 * A[j, 4]^2) / (1 + A[j, 4] * Expr1)^2) /Expr4/A[j,1]  #K_V
        F[k] = A[j, 2] * (A[j+1, 1] / A[j, 1])^((Expr3 - 1) / Expr3) - A[j+1, 2]
    end
    for j in 1:2:4#(P)
        k = k + 1
        Expr2 = 0
        #(a,b)=srk(zf)#组分在发生改变，这个怎么确定并使用
        #b就不了,b[i]=0.08664*R*Tc[i]/Pc[i],b=b[i]*x[i]
        zf = [A[j, 6] A[j, 7] A[j, 8] A[j, 9] A[j, 10] A[j, 11]]
        #for i in 1:length(zf) 
        #Tcc+=Tc[i]*zf[i]
        #end#求总的临界温度
        #push!(gg,Tcc)
        μ0 = A[j, 6] * μ[1] + A[j, 7] * μ[2] + A[j, 8] * μ[3] + A[j, 9] * μ[4] + A[j, 10] * μ[5] + A[j, 11] * μ[6]
        Pcc = 0
        ww = 0
        Tcc = 0
        Expr1 = 0.08664 * R * (Tc[1] / Pc[1] * A[j, 6] + Tc[2] / Pc[2] * A[j, 7] + Tc[3] / Pc[3] * A[j, 8] +
                               Tc[4] / Pc[4] * A[j, 9] + Tc[5] / Pc[5] * A[j, 10] + Tc[6] / Pc[6] * A[j, 11])#b的表达式

        for i in 1:length(zf)
            Tcc += zf[i] * Tc[i]
            Pcc += zf[i] * Pc[i]
            ww += zf[i] * w[i]
        end
        for i in 1:length(Tc)
            mn = 0.42747 * (R^2) * (Tc[i]^2) / Pc[i]
            push!(ac, mn)
            mnl = 1 + (0.480 + 1.574 * w[i] - 0.176 * w[i]^2) * (1 - (A[j, 2] / Tcc)^(0.5))#T[j]
            push!(d, mnl)
            s = ac[i] * d[i]
            push!(a, s)
        end
        for i in 1:length(zf)
            for n in 1:length(zf)
                Expr2 += zf[i] * zf[n] * (a[i] * a[n])^(0.5) * (1 - K[i, n])
            end
        end#（a）
        piandao1 = R / (1 /( A[j, 4]/μ0) - Expr1) - 0.42748 * R^2 * Tcc^2 / Pcc * ( (0.480 + 1.574 * ww - 0.176 * ww^2) * (-1 / 2 / (A[j, 2] * Tcc)^(0.5)) / (1/(A[j,4]/μ0)*(1/(A[j,4]/μ0)+Expr1)))#压力对温度的偏导
        piandao2 = 1 / ((-R * A[j, 2] / (1 / (A[j, 4]/μ0) - Expr1)^2) + Expr2 * (2 / (A[j, 4]/μ0) + Expr1) / (1 / (A[j, 4]/μ0) * (1 / (A[j, 4]/μ0) + Expr1))^2)#比容对压力的偏导
        Expr3 = 1 / (1 - A[j, 1]*1000 / A[j, 4]^2 / (13.19 + 0.092 * A[j, 2] - 6.24 * 10^(-5) * A[j, 2]^2 + 1.915 * 10^11 *
                μ0 * ((A[j, 1])^1.124) / (A[j, 2]^5.08)) * piandao1 / (R * A[j, 2] / (1 - A[j, 4] * Expr1)^2 - (2 * Expr2 * A[j, 4] + Expr1 * Expr2 * A[j, 4]^2) / (1 + A[j, 4] * Expr1)^2))#K_T
        Expr4 = (13.19 + 0.092 * A[j, 2] - 6.24 * 10^(-5) * A[j, 2]^2 + 1.915 * 10^11 * μ0 * ((A[j, 1])^1.124) /
                 (A[j, 2]^5.08)) - A[j, 2] / (A[j, 4]/μ0)^2 * piandao1^2 / (R * A[j, 2] / (1 - (A[j, 4]/μ0) * Expr1)^2 - (2 * Expr2 * A[j, 4] + Expr1 * Expr2 *( A[j, 4]/μ0)^2) / (1 + (A[j, 4]/μ0) * Expr1)^2)^2#Cvm
        Expr5 = (A[j, 4]/μ0) * (13.19 + 0.092 * A[j, 2] - 6.24 * 10^(-5) * A[j, 2]^2 + 1.915 * 10^11 * μ0 * ((A[j, 1])^1.124) /
                (A[j, 2]^5.08)) * (R * A[j, 2] / (1 - (A[j, 4]/μ0) * Expr1)^2 - (2 * Expr2 * (A[j, 4]/μ0) + Expr1 * Expr2 *( A[j, 4]/μ0)^2) / (1 + (A[j, 4]/μ0) * Expr1)^2) / Expr4/A[j,1]/1000 #K_V
        #F[k]=A[j+1,1]*10^6-A[j,1]*10^6(A[j+1,2]/A[j,2])^(Expr3/(Expr3-1))
        F[k] = A[j+1, 1]*10^6 - A[j, 1]*10^6* (A[j+1, 4] / A[j, 4])^(Expr5)
    end
    for j in 1:2:4#(氢气)摩尔百分比A【，6，7...】(质量分数不变)（需要把摩尔分数变成质量分数）
        k = k + 1
        μ0 = A[j, 6] * μ[1] + A[j, 7] * μ[2] + A[j, 8] * μ[3] + A[j, 9] * μ[4] + A[j, 10] * μ[5] + A[j, 11]
        μ1 = A[j+1, 6] * μ[1] + A[j+1, 7] * μ[2] + A[j+1, 8] * μ[3] + A[j+1, 9] * μ[4] + A[j+1, 10] * μ[5] + A[j+1, 11]
        F[k] = (A[j, 6] / μ0 - A[j+1, 6] / μ1) * μ[1]
    end
    for j in 1:2:4#(甲烷)
        k = k + 1
        μ0 = A[j, 6] * μ[1] + A[j, 7] * μ[2] + A[j, 8] * μ[3] + A[j, 9] * μ[4] + A[j, 10] * μ[5] + A[j, 11]
        μ1 = A[j+1, 6] * μ[1] + A[j+1, 7] * μ[2] + A[j+1, 8] * μ[3] + A[j+1, 9] * μ[4] + A[j+1, 10] * μ[5] + A[j+1, 11]
        F[k] = (A[j, 7] / μ0 - A[j+1, 7] / μ1) * μ[2]
    end
    for j in 1:2:4#(乙烷)
        k = k + 1
        μ0 = A[j, 6] * μ[1] + A[j, 7] * μ[2] + A[j, 8] * μ[3] + A[j, 9] * μ[4] + A[j, 10] * μ[5] + A[j, 11]
        μ1 = A[j+1, 6] * μ[1] + A[j+1, 7] * μ[2] + A[j+1, 8] * μ[3] + A[j+1, 9] * μ[4] + A[j+1, 10] * μ[5] + A[j+1, 11]
        F[k] = (A[j, 8] / μ0 - A[j+1, 8] / μ1) * μ[3]
    end
    for j in 1:2:4#(丙烷)
        k = k + 1
        μ0 = A[j, 6] * μ[1] + A[j, 7] * μ[2] + A[j, 8] * μ[3] + A[j, 9] * μ[4] + A[j, 10] * μ[5] + A[j, 11]
        μ1 = A[j+1, 6] * μ[1] + A[j+1, 7] * μ[2] + A[j+1, 8] * μ[3] + A[j+1, 9] * μ[4] + A[j+1, 10] * μ[5] + A[j+1, 11]
        F[k] = (A[j, 9] / μ0 - A[j+1, 9] / μ1) * μ[4]
    end
    for j in 1:2:4#(氮气)
        k = k + 1
        μ0 = A[j, 6] * μ[1] + A[j, 7] * μ[2] + A[j, 8] * μ[3] + A[j, 9] * μ[4] + A[j, 10] * μ[5] + A[j, 11]
        μ1 = A[j+1, 6] * μ[1] + A[j+1, 7] * μ[2] + A[j+1, 8] * μ[3] + A[j+1, 9] * μ[4] + A[j+1, 10] * μ[5] + A[j+1, 11]
        F[k] = (A[j, 10] / μ0 - A[j+1, 10] / μ1) * μ[5]
    end
    for j in 1:2:4#(二氧化碳)
        k = k + 1
        μ0 = A[j, 6] * μ[1] + A[j, 7] * μ[2] + A[j, 8] * μ[3] + A[j, 9] * μ[4] + A[j, 10] * μ[5] + A[j, 11]
        μ1 = A[j+1, 6] * μ[1] + A[j+1, 7] * μ[2] + A[j+1, 8] * μ[3] + A[j+1, 9] * μ[4] + A[j+1, 10] * μ[5] + A[j+1, 11]
        F[k] = (A[j, 11] / μ0 - A[j+1, 11] / μ1) * μ[6]
    end
    #----------------------------------------------------边界条件（11个）--------------------------------------------------
    F[45] = A[2, 1] - 9.8#压缩机1的出口压力(转速)（突然掺氢）
    F[46] = A[4, 1] - 9.8#压缩机2的出口压力
    F[47] = A[5, 3] - 600#分输点的质量流量随时间变化（末端流量）
    F[48] = A[1, 7] - 0.92#甲烷浓度（摩尔分数）的变化(自己假设)
    F[49] = A[1, 8] - 0.045#乙烷浓度的变化
    F[50] = A[1, 9] - 0.008#丙烷浓度的变化
    F[51] = A[1, 6] - 0.013#氢气浓度的变化
    F[52] = A[1, 10] - 0.01#氮气浓度的变化
    F[53] = A[1, 11] - 0.004#二氧化碳浓度的变化
    F[54] = A[1, 1] - 8.6#气源压力随时间变化
    F[55] = A[1, 2] - 310#气源温度随时间变化
println(A)
end


